УчетВУправляющихДляГит1/src/InformationRegisters/КВП_БлагоустройствоОбъектов/КВП_БлагоустройствоОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КВП_БлагоустройствоОбъектов</name>
  <comment>Благоустройство объектов</comment>
  <resources>
    <name>Значение</name>
    <comment>Значение</comment>
    <type>
      <types>EnumRef.УПЖКХ_ВидыСанУзла</types>
      <types>Boolean</types>
      <types>EnumRef.КВП_Канализация</types>
      <types>EnumRef.УПЖКХ_ТипыГорячегоВодоснабжения</types>
      <types>String</types>
      <types>Date</types>
      <types>EnumRef.КВП_Плита</types>
      <types>Number</types>
      <types>EnumRef.УПЖКХ_ТипЗапирающегоУстройства</types>
      <types>EnumRef.УПЖКХ_ТипыХолодногоВодоснабжения</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.КВП_Здания</types>
      <types>CatalogRef.УПЖКХ_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБлагоустройства</name>
    <comment>Вид благоустройства</comment>
    <type>
      <types>CatalogRef.КВП_ВидыБлагоустройстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/КВП_БлагоустройствоОбъектов/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события формы "ПриСозданииНаСервере".
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборОбъект") Тогда
		Запись.Объект = Параметры.ОтборОбъект;
		Элементы.Объект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидБлагоустройства") Тогда
		Запись.ВидБлагоустройства = Параметры.ВидБлагоустройства;
	КонецЕсли;
	
	Если Параметры.Свойство("Значение") Тогда
		Запись.Значение = Параметры.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик события формы "ПослеЗаписи".
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьТаблицуБлагоустройствоОбъектов");
	
КонецПроцедуры

#КонецОбласти
